      ******************************************************************
      * Author: Breno Lucena
      * Date: 14/06/2023
      * Purpose: Primeiro Programa Cobol - Demo
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM01.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM PROGRAM01.
