      ******************************************************************
      * Author: Breno Lucena
      * Date: 19/06/2023
      * Purpose: Primeiro Programa Cobol - Demo
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. programa02.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
            DISPLAY "Este programa contem Quatro DIVISIONS,"
            DISPLAY "Duas SECTIONS,"
            DISPLAY "Quatro PARAGRAPHS"
            DISPLAY "e Cinco SENTENCES".
       PROGRAM-DONE.
            STOP RUN.
       END PROGRAM programa02.
