      ******************************************************************
      * Author: Breno Lucena
      * Date: 19/06/2023
      * Purpose: Primeiro Programa Cobol - Constantes
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. programa03.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
            DISPLAY "Isto e uma constante literal do tipo TEXTO"
            DISPLAY 55
            DISPLAY 12.607.
       PROGRAM-DONE.
            STOP RUN.
       END PROGRAM programa03.
